Revit 2024 API
Document.MullionTypes Property
This property is used to retrieve all the mullion types in current system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public MullionTypeSet MullionTypes { get; }
Visual Basic
Public ReadOnly Property MullionTypes As MullionTypeSet
	Get
Visual C++
public:
property MullionTypeSet^ MullionTypes {
	MullionTypeSet^ get ();
}
Remarks
This property returns a set of MullionType objects. These objects can be used change the type of a mullion from one type to another.
See Also
Document Class
Autodesk.Revit.DB Namespace